In [1]:
# importing the required modules and libraries for cleaning
import pandas as pd
import numpy as np

#### Loading the "titanic dataset" to clean.

In [2]:
titanic = pd.read_csv("D:\\Data_Science\\EDA_Projects\\Titanic_Dataset_EDA\\dataset\\Titanic-Dataset.csv")

In [3]:
titanic.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S
864,865,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,NaN,S
501,502,0,3,"Canavan, Miss. Mary",female,21.0,0,0,364846,7.7500,NaN,Q
455,456,1,3,"Jalsevac, Mr. Ivan",male,29.0,0,0,349240,7.8958,NaN,C
777,778,1,3,"Emanuel, Miss. Virginia Ethel",female,5.0,0,0,364516,12.4750,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
639,640,0,3,"Thorneycroft, Mr. Percival",male,NaN,1,0,376564,16.1000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
586,587,0,2,"Jarvis, Mr. John Denzil",male,47.0,0,0,237565,15.0000,NaN,S
807,808,0,3,"Pettersson, Miss. Ellen Natalia",female,18.0,0,0,347087,7.7750,NaN,S

In [4]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#### Renaming some columns as required.

In [5]:
titanic.rename(columns = {"PassengerId" : "PassengerID", "Parch" : "ParCh"}, inplace = True)

In [6]:
titanic.sample(10)

,PassengerID,Survived,Pclass,Name,Sex,Age,SibSp,ParCh,Ticket,Fare,Cabin,Embarked
856,857,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,36928,164.8667,NaN,S
107,108,1,3,"Moss, Mr. Albert Johan",male,NaN,0,0,312991,7.7750,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
192,193,1,3,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,1,0,350046,7.8542,NaN,S
161,162,1,2,"Watt, Mrs. James (Elizabeth ""Bessie"" Inglis Mi...",female,40.0,0,0,C.A. 33595,15.7500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
668,669,0,3,"Cook, Mr. Jacob",male,43.0,0,0,A/5 3536,8.0500,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
734,735,0,2,"Troupiansky, Mr. Moses Aaron",male,23.0,0,0,233639,13.0000,NaN,S
677,678,1,3,"Turja, Miss. Anna Sofia",female,18.0,0,0,4138,9.8417,NaN,S

#### Dropping duplicate rows for convenience (if exists)

In [7]:
titanic.drop_duplicates(inplace = True)

In [8]:
titanic.info() # => no row was duplicate or repeated

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerID  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   ParCh        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#### Filling in Yes/No in the column["Survived"]

In [9]:
titanic["Survived"] = titanic["Survived"].replace({0 : "No", 1 : "Yes"})

In [10]:
titanic.sample(10)

,PassengerID,Survived,Pclass,Name,Sex,Age,SibSp,ParCh,Ticket,Fare,Cabin,Embarked
773,774,No,3,"Elias, Mr. Dibo",male,NaN,0,0,2674,7.2250,NaN,C
665,666,No,2,"Hickman, Mr. Lewis",male,32.0,2,0,S.O.C. 14879,73.5000,NaN,S
839,840,Yes,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C47,C
394,395,Yes,3,"Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengt...",female,24.0,0,2,PP 9549,16.7000,G6,S
820,821,Yes,1,"Hays, Mrs. Charles Melville (Clara Jennings Gr...",female,52.0,1,1,12749,93.5000,B69,S
862,863,Yes,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
408,409,No,3,"Birkeland, Mr. Hans Martin Monsen",male,21.0,0,0,312992,7.7750,NaN,S
278,279,No,3,"Rice, Master. Eric",male,7.0,4,1,382652,29.1250,NaN,Q
711,712,No,1,"Klaber, Mr. Herman",male,NaN,0,0,113028,26.5500,C124,S
143,144,No,3,"Burke, Mr. Jeremiah",male,19.0,0,0,365222,6.7500,NaN,Q

#### Separating family name from the column["Name"]

In [11]:
family_data_sr = titanic["Name"].str.split(", ").str[0] # extracting family data

In [12]:
titanic["Name"] = titanic["Name"].str.split(", ").str[1] # removing the family name

In [13]:
titanic.insert(4, "Family", family_data_sr) # inserting the new column

In [14]:
titanic.sample(10)

,PassengerID,Survived,Pclass,Name,Family,Sex,Age,SibSp,ParCh,Ticket,Fare,Cabin,Embarked
736,737,No,3,Mrs. Edward (Margaret Ann Watson),Ford,female,48.0,1,3,W./C. 6608,34.3750,NaN,S
292,293,No,2,Mr. Rene Jacques,Levy,male,36.0,0,0,SC/Paris 2163,12.8750,D,C
665,666,No,2,Mr. Lewis,Hickman,male,32.0,2,0,S.O.C. 14879,73.5000,NaN,S
28,29,Yes,3,"Miss. Ellen ""Nellie""",O'Dwyer,female,NaN,0,0,330959,7.8792,NaN,Q
122,123,No,2,Mr. Nicholas,Nasser,male,32.5,1,0,237736,30.0708,NaN,C
353,354,No,3,Mr. Josef,Arnold-Franchi,male,25.0,1,0,349237,17.8000,NaN,S
679,680,Yes,1,Mr. Thomas Drake Martinez,Cardeza,male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
589,590,No,3,Mr. Joseph,Murdlin,male,NaN,0,0,A./5. 3235,8.0500,NaN,S
562,563,No,2,Mr. Robert Douglas,Norman,male,28.0,0,0,218629,13.5000,NaN,S
230,231,Yes,1,Mrs. Henry Birkhardt (Irene Wallach),Harris,female,35.0,1,0,36973,83.4750,C83,S

#### Filling in M/F in the column["Sex"] for convenience.

In [15]:
titanic["Sex"].nunique()

2

In [16]:
titanic["Sex"] = titanic["Sex"].replace({"male": "M", "female": "F"})

In [17]:
titanic.sample(10)

,PassengerID,Survived,Pclass,Name,Family,Sex,Age,SibSp,ParCh,Ticket,Fare,Cabin,Embarked
104,105,No,3,Mr. Anders Vilhelm,Gustafsson,M,37.0,2,0,3101276,7.9250,NaN,S
650,651,No,3,Mr. Mito,Mitkoff,M,NaN,0,0,349221,7.8958,NaN,S
781,782,Yes,1,Mrs. Albert Adrian (Vera Gillespie),Dick,F,17.0,1,0,17474,57.0000,B20,S
103,104,No,3,Mr. Gustaf Joel,Johansson,M,33.0,0,0,7540,8.6542,NaN,S
761,762,No,3,Mr. Iisakki Antino Aijo,Nirva,M,41.0,0,0,SOTON/O2 3101272,7.1250,NaN,S
608,609,Yes,2,Mrs. Joseph (Juliette Marie Louise Lafargue),Laroche,F,22.0,1,2,SC/Paris 2123,41.5792,NaN,C
152,153,No,3,Mr. Alfonzo,Meo,M,55.5,0,0,A.5. 11206,8.0500,NaN,S
646,647,No,3,Mr. Liudevit,Cor,M,19.0,0,0,349231,7.8958,NaN,S
422,423,No,3,Mr. Leo,Zimmerman,M,29.0,0,0,315082,7.8750,NaN,S
799,800,No,3,Mrs. Jean Baptiste (Rosalie Paula Govaert),Van Impe,F,30.0,1,1,345773,24.1500,NaN,S

In [18]:
titanic.groupby(["Pclass"]).agg({"Age": "mean"})

              Age
Pclass
1       38.233441
2       29.877630
3       25.140620

In [19]:
titanic.groupby(["Pclass", "Sex"]).agg({"Age": "mean"})

                  Age
Pclass Sex
1      F    34.611765
       M    41.281386
2      F    28.722973
       M    30.740707
3      F    21.750000
       M    26.507589

#### Filling in the column["Age"] on the basis of columns["Pclass", "Sex"]

In [20]:
titanic["Age"] = titanic.groupby(["Pclass", "Sex"])["Age"].transform(lambda x: x.fillna(x.median()))

In [21]:
titanic.sample(10)

,PassengerID,Survived,Pclass,Name,Family,Sex,Age,SibSp,ParCh,Ticket,Fare,Cabin,Embarked
749,750,No,3,Mr. Michael,Connaghton,M,31.0,0,0,335097,7.7500,NaN,Q
109,110,Yes,3,Miss. Bertha,Moran,F,21.5,1,0,371110,24.1500,NaN,Q
255,256,Yes,3,Mrs. Darwis (Hanne Youssef Razi),Touma,F,29.0,0,2,2650,15.2458,NaN,C
314,315,No,2,Mr. Benjamin,Hart,M,43.0,1,1,F.C.C. 13529,26.2500,NaN,S
326,327,No,3,Mr. Johan Hansen,Nysveen,M,61.0,0,0,345364,6.2375,NaN,S
234,235,No,2,Mr. Robert William Norman,Leyson,M,24.0,0,0,C.A. 29566,10.5000,NaN,S
781,782,Yes,1,Mrs. Albert Adrian (Vera Gillespie),Dick,F,17.0,1,0,17474,57.0000,B20,S
758,759,No,3,Mr. Thomas Leonard,Theobald,M,34.0,0,0,363294,8.0500,NaN,S
184,185,Yes,3,Miss. Luise Gretchen,Kink-Heilmann,F,4.0,0,2,315153,22.0250,NaN,S
369,370,Yes,1,Mme. Leontine Pauline,Aubart,F,24.0,0,0,PC 17477,69.3000,B35,C

In [22]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerID  891 non-null    int64
 1   Survived     891 non-null    object
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Family       891 non-null    object
 5   Sex          891 non-null    object
 6   Age          891 non-null    float64
 7   SibSp        891 non-null    int64
 8   ParCh        891 non-null    int64
 9   Ticket       891 non-null    object
 10  Fare         891 non-null    float64
 11  Cabin        204 non-null    object
 12  Embarked     889 non-null    object
dtypes: float64(2), int64(4), object(7)
memory usage: 90.6+ KB

#### Replacing the column["Cabin"] with new column["Cabin_Missing"]

In [23]:
titanic.head(10)

,PassengerID,Survived,Pclass,Name,Family,Sex,Age,SibSp,ParCh,Ticket,Fare,Cabin,Embarked
0,1,No,3,Mr. Owen Harris,Braund,M,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,Yes,1,Mrs. John Bradley (Florence Briggs Thayer),Cumings,F,38.0,1,0,PC 17599,71.2833,C85,C
2,3,Yes,3,Miss. Laina,Heikkinen,F,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,Yes,1,Mrs. Jacques Heath (Lily May Peel),Futrelle,F,35.0,1,0,113803,53.1000,C123,S
4,5,No,3,Mr. William Henry,Allen,M,35.0,0,0,373450,8.0500,NaN,S
5,6,No,3,Mr. James,Moran,M,25.0,0,0,330877,8.4583,NaN,Q
6,7,No,1,Mr. Timothy J,McCarthy,M,54.0,0,0,17463,51.8625,E46,S
7,8,No,3,Master. Gosta Leonard,Palsson,M,2.0,3,1,349909,21.0750,NaN,S
8,9,Yes,3,Mrs. Oscar W (Elisabeth Vilhelmina Berg),Johnson,F,27.0,0,2,347742,11.1333,NaN,S
9,10,Yes,2,Mrs. Nicholas (Adele Achem),Nasser,F,14.0,1,0,237736,30.0708,NaN,C

In [24]:
titanic["Cabin_Missing"] = titanic["Cabin"].notna()

In [25]:
titanic.head(10)

,PassengerID,Survived,Pclass,Name,Family,Sex,Age,SibSp,ParCh,Ticket,Fare,Cabin,Embarked,Cabin_Missing
0,1,No,3,Mr. Owen Harris,Braund,M,22.0,1,0,A/5 21171,7.2500,NaN,S,False
1,2,Yes,1,Mrs. John Bradley (Florence Briggs Thayer),Cumings,F,38.0,1,0,PC 17599,71.2833,C85,C,True
2,3,Yes,3,Miss. Laina,Heikkinen,F,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,False
3,4,Yes,1,Mrs. Jacques Heath (Lily May Peel),Futrelle,F,35.0,1,0,113803,53.1000,C123,S,True
4,5,No,3,Mr. William Henry,Allen,M,35.0,0,0,373450,8.0500,NaN,S,False
5,6,No,3,Mr. James,Moran,M,25.0,0,0,330877,8.4583,NaN,Q,False
6,7,No,1,Mr. Timothy J,McCarthy,M,54.0,0,0,17463,51.8625,E46,S,True
7,8,No,3,Master. Gosta Leonard,Palsson,M,2.0,3,1,349909,21.0750,NaN,S,False
8,9,Yes,3,Mrs. Oscar W (Elisabeth Vilhelmina Berg),Johnson,F,27.0,0,2,347742,11.1333,NaN,S,False
9,10,Yes,2,Mrs. Nicholas (Adele Achem),Nasser,F,14.0,1,0,237736,30.0708,NaN,C,False

In [26]:
# deleting
del titanic["Cabin"]

In [27]:
titanic.head(10)

,PassengerID,Survived,Pclass,Name,Family,Sex,Age,SibSp,ParCh,Ticket,Fare,Embarked,Cabin_Missing
0,1,No,3,Mr. Owen Harris,Braund,M,22.0,1,0,A/5 21171,7.2500,S,False
1,2,Yes,1,Mrs. John Bradley (Florence Briggs Thayer),Cumings,F,38.0,1,0,PC 17599,71.2833,C,True
2,3,Yes,3,Miss. Laina,Heikkinen,F,26.0,0,0,STON/O2. 3101282,7.9250,S,False
3,4,Yes,1,Mrs. Jacques Heath (Lily May Peel),Futrelle,F,35.0,1,0,113803,53.1000,S,True
4,5,No,3,Mr. William Henry,Allen,M,35.0,0,0,373450,8.0500,S,False
5,6,No,3,Mr. James,Moran,M,25.0,0,0,330877,8.4583,Q,False
6,7,No,1,Mr. Timothy J,McCarthy,M,54.0,0,0,17463,51.8625,S,True
7,8,No,3,Master. Gosta Leonard,Palsson,M,2.0,3,1,349909,21.0750,S,False
8,9,Yes,3,Mrs. Oscar W (Elisabeth Vilhelmina Berg),Johnson,F,27.0,0,2,347742,11.1333,S,False
9,10,Yes,2,Mrs. Nicholas (Adele Achem),Nasser,F,14.0,1,0,237736,30.0708,C,False

#### Filling the null values in the column["Embarked"] with the mode of it.

In [28]:
titanic["Embarked"] = titanic["Embarked"].fillna(titanic["Embarked"].mode()[0])

In [29]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   PassengerID    891 non-null    int64
 1   Survived       891 non-null    object
 2   Pclass         891 non-null    int64
 3   Name           891 non-null    object
 4   Family         891 non-null    object
 5   Sex            891 non-null    object
 6   Age            891 non-null    float64
 7   SibSp          891 non-null    int64
 8   ParCh          891 non-null    int64
 9   Ticket         891 non-null    object
 10  Fare           891 non-null    float64
 11  Embarked       891 non-null    object
 12  Cabin_Missing  891 non-null    bool
dtypes: bool(1), float64(2), int64(4), object(6)
memory usage: 84.5+ KB

In [30]:
# final look
titanic.sample(10)

,PassengerID,Survived,Pclass,Name,Family,Sex,Age,SibSp,ParCh,Ticket,Fare,Embarked,Cabin_Missing
304,305,No,3,"Mr. Howard Hugh ""Harry""",Williams,M,25.0,0,0,A/5 2466,8.0500,S,False
16,17,No,3,Master. Eugene,Rice,M,2.0,4,1,382652,29.1250,Q,False
438,439,No,1,Mr. Mark,Fortune,M,64.0,1,4,19950,263.0000,S,True
241,242,Yes,3,"Miss. Katherine ""Kate""",Murphy,F,21.5,1,0,367230,15.5000,Q,False
875,876,Yes,3,"Miss. Adele Kiamie ""Jane""",Najib,F,15.0,0,0,2667,7.2250,C,False
58,59,Yes,2,Miss. Constance Mirium,West,F,5.0,1,2,C.A. 34651,27.7500,S,False
606,607,No,3,Mr. Milan,Karaic,M,30.0,0,0,349246,7.8958,S,False
642,643,No,3,Miss. Margit Elizabeth,Skoog,F,2.0,3,2,347088,27.9000,S,False
23,24,Yes,1,Mr. William Thompson,Sloper,M,28.0,0,0,113788,35.5000,S,True
3,4,Yes,1,Mrs. Jacques Heath (Lily May Peel),Futrelle,F,35.0,1,0,113803,53.1000,S,True

#### Saving the cleaned dataset.

In [31]:
titanic.to_csv("D:\\Data_Science\\EDA_Projects\\Titanic_Dataset_EDA\\dataset\\Titanic-Dataset-Cleaned.csv", index = False)

# **Dataset Is Cleaned !!**